AntonBronnfjell/project-esp32-embedsyst-cpp_ble-jammer-nrf24l01/main/jammer_main.cpp
static void stop_jamming_radios(void)
{
    radio1.powerDown();
    radio2.powerDown();
}

// ---------- Built-in RGB LED: rainbow only while jamming is active ----------
static void hsv_to_rgb(uint32_t h, uint8_t s, uint8_t v, uint8_t* r, uint8_t* g, uint8_t* b)
{
    if (s == 0) {
        *r = *g = *b = v;
        return;
    }
    uint32_t region = h / 60;
    uint32_t remainder = (h % 60) * 256 / 60;
    uint32_t p = (v * (255 - s)) / 255;
    uint32_t q = (v * (255 - (s * remainder) / 256)) / 255;
    uint32_t t = (v * (255 - (s * (256 - remainder)) / 256)) / 255;
    switch (region) {
        case 0:  *r = (uint8_t)v; *g = (uint8_t)t; *b = (uint8_t)p; break;
        case 1:  *r = (uint8_t)q; *g = (uint8_t)v; *b = (uint8_t)p; break;
        case 2:  *r = (uint8_t)p; *g = (uint8_t)v; *b = (uint8_t)t; break;
        case 3:  *r = (uint8_t)p; *g = (uint8_t)q; *b = (uint8_t)v; break;
        case 4:  *r = (uint8_t)t; *g = (uint8_t)p; *b = (uint8_t)v; break;
        default: *r = (uint8_t)v; *g = (uint8_t)p; *b = (uint8_t)q; break;
    }
}

static void set_rgb_led(uint8_t r, uint8_t g, uint8_t b)
{
    if (!s_rmt_chan || !s_led_encoder) return;
    uint8_t grb[3] = { g, r, b };  // WS2812 order
    rmt_transmit_config_t tx_config = {};
    tx_config.loop_count = 0;
    ESP_ERROR_CHECK(rmt_transmit(s_rmt_chan, s_led_encoder, grb, sizeof(grb), &tx_config));
    ESP_ERROR_CHECK(rmt_tx_wait_all_done(s_rmt_chan, portMAX_DELAY));
}

static void init_rgb_led(void)
{
    rmt_tx_channel_config_t tx_cfg = {};
    tx_cfg.clk_src = RMT_CLK_SRC_DEFAULT;
    tx_cfg.gpio_num = (gpio_num_t)WS2812_GPIO;
    tx_cfg.mem_block_symbols = 64;
    tx_cfg.resolution_hz = RMT_RESOLUTION;
    tx_cfg.trans_queue_depth = 1;
    ESP_ERROR_CHECK(rmt_new_tx_channel(&tx_cfg, &s_rmt_chan));
    led_strip_encoder_config_t enc_cfg = {};
    enc_cfg.resolution = RMT_RESOLUTION;
    ESP_ERROR_CHECK(rmt_new_led_strip_encoder(&enc_cfg, &s_led_encoder));
    ESP_ERROR_CHECK(rmt_enable(s_rmt_chan));
    set_rgb_led(0, 0, 0);
}

static void rainbow_led_task(void* arg)
{
    (void)arg;
    uint32_t hue = 0;
    const uint8_t sat = 255;
    const uint8_t val = 200;
    for (;;) {
        if (!s_jamming_active) {
            set_rgb_led(0, 0, 0);  // LED off when jamming stopped
            vTaskDelay(pdMS_TO_TICKS(RAINBOW_MS_SLOW));
            continue;
        }
        uint32_t delay_ms = (currentMode == MODE_CONSTANT_CARRIER) ? RAINBOW_MS_SLOW : RAINBOW_MS_FAST;
        uint8_t r, g, b;
        hsv_to_rgb(hue % 360, sat, val, &r, &g, &b);
        set_rgb_led(r, g, b);
        hue += 3;
        vTaskDelay(pdMS_TO_TICKS(delay_ms));
    }
}

// ---------- WiFi raw TX: 3rd transmitter using ESP32's built-in 2.4 GHz radio ----------
// Each WiFi channel is 20 MHz wide — covers ~20 Bluetooth channels at once.
// WiFi ch 1 = 2412 MHz (BT ch 12), ch 6 = 2437 MHz (BT ch 37), ch 11 = 2462 MHz (BT ch 62)

static void init_wifi_jammer(void)
{
    ESP_ERROR_CHECK(esp_event_loop_create_default());
    ESP_ERROR_CHECK(esp_netif_init());

    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_wifi_init(&cfg));
    ESP_ERROR_CHECK(esp_wifi_set_storage(WIFI_STORAGE_RAM));
    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
    ESP_ERROR_CHECK(esp_wifi_start());
    ESP_ERROR_CHECK(esp_wifi_set_channel(1, WIFI_SECOND_CHAN_NONE));
    esp_wifi_set_max_tx_power(80);

    xTaskCreatePinnedToCore(wifi_jam_task, "wifi_jam", 4096, NULL, 5, NULL, 0);
    LOG_INIT("WiFi raw TX started (3rd transmitter, built-in antenna)");
}

static void wifi_jam_task(void* arg)
{
    (void)arg;
    static const uint8_t wifi_channels[] = { 1, 6, 11 };
    uint8_t ch_idx = 0;
    uint32_t pkt_count = 0;

    for (;;) {
        if (!s_jamming_active) {
            vTaskDelay(pdMS_TO_TICKS(50));
            continue;
        }

        esp_wifi_80211_tx(WIFI_IF_STA, s_beacon_frame, sizeof(s_beacon_frame), false);

        if (++pkt_count >= 50) {
            pkt_count = 0;
            ch_idx = (ch_idx + 1) % 3;
            esp_wifi_set_channel(wifi_channels[ch_idx], WIFI_SECOND_CHAN_NONE);
        }

        vTaskDelay(1);
    }
}

static void log_nrf24_spi_probe(const char* bus_name, SPI& spi)
{
    uint8_t st_aw = 0, aw = 0;
    uint8_t st_cfg = 0, cfg = 0;
    if (!spi.readNrf24Register(SETUP_AW, &st_aw, &aw)) {
        LOG_WRN("%s SPI probe: bus not initialized", bus_name);
        return;
    }
    (void)spi.readNrf24Register(NRF_CONFIG, &st_cfg, &cfg);
    LOG_WRN("%s SPI probe: SETUP_AW=0x%02x (status=0x%02x) CONFIG=0x%02x (status=0x%02x)",
            bus_name, (unsigned)aw, (unsigned)st_aw, (unsigned)cfg, (unsigned)st_cfg);
    LOG_WRN("%s If SETUP_AW is 0x03 and CONFIG ~0x08: chip likely OK (check CE/SPI speed). 0xFF/0x00: MISO floating or MOSI/SCK/CSN wrong, or no 3.3V/GND.",
            bus_name);
}

static void init_nrf24_modules(void)
{
    LOG_INIT("SPI0 (HSPI): SCK=%d MISO=%d MOSI=%d CSN=%d", SCK_PIN_1, MISO_PIN_1, MOSI_PIN_1, CSN_PIN_1);
    spi0.begin(SCK_PIN_1, MISO_PIN_1, MOSI_PIN_1, CSN_PIN_1, JAMMER_NRF24_SPI_HZ);
    LOG_INIT("SPI1 (VSPI): SCK=%d MISO=%d MOSI=%d CSN=%d", SCK_PIN_2, MISO_PIN_2, MOSI_PIN_2, CSN_PIN_2);
    spi1.begin(SCK_PIN_2, MISO_PIN_2, MOSI_PIN_2, CSN_PIN_2, JAMMER_NRF24_SPI_HZ);

    bool module1_ok = false;
    bool module2_ok = false;

    LOG_RF1("begin() CE=%d CSN=%d...", CE_PIN_1, CSN_PIN_1);
    if (radio1.begin(&spi0)) {
        vTaskDelay(pdMS_TO_TICKS(100));
        LOG_RF1("OK | connected=%s", radio1.isChipConnected() ? "yes" : "no");
        module1_ok = true;
    } else {
        LOG_ERR("RF1 (HSPI) begin FAILED - check wiring CE=%d CSN=%d", CE_PIN_1, CSN_PIN_1);
        log_nrf24_spi_probe("RF1", spi0);
    }

    LOG_RF2("begin() CE=%d CSN=%d...", CE_PIN_2, CSN_PIN_2);
    if (radio2.begin(&spi1)) {
        vTaskDelay(pdMS_TO_TICKS(100));
        LOG_RF2("OK | connected=%s", radio2.isChipConnected() ? "yes" : "no");
        module2_ok = true;
    } else {
        LOG_ERR("RF2 (VSPI) begin FAILED - check wiring CE=%d CSN=%d", CE_PIN_2, CSN_PIN_2);
        log_nrf24_spi_probe("RF2", spi1);
    }

    if (!module1_ok && !module2_ok) {
        LOG_ERR("No NRF24 modules. Button/BLE still work.");
        LOG_WRN("Hardware check: 3.3V on VCC, common GND, swap MISO/MOSI if probe is 0xFF/0x00; test module on a known-good Arduino+nRF24 sketch.");
        return;
    }

