AntonBronnfjell/project-esp32-embedsyst-cpp_ble-jammer-nrf24l01/main/jammer_main.cpp
// MODE 1: BLE ADV + BARRAGE — hybrid attack on both control and data planes.
// Radio 1 rapid-cycles the 3 BLE adv channels (same pattern that worked before).
// Radio 2 does random barrage across all 80 channels — keeps AFH busy.
static void jam_ble_adv_barrage(void)
{
    hop_carrier(radio1, ble_adv_channels[ble_adv_idx]);
    ble_adv_idx = (ble_adv_idx + 1) % 3;
    hop_carrier(radio2, rand_channel());
}

// BT Classic: all 79 FHSS data channels (nRF24 ch 2-80)
static const uint8_t bt_classic_channels[] = {
     2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
    18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33,
    34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49,
    50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65,
    66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80,
};
#define BT_CLASSIC_CH_COUNT (sizeof(bt_classic_channels) / sizeof(bt_classic_channels[0]))

// MODE 1: BT CLASSIC — CW sequential sweep ch 2-80 with 130 µs PLL dwell.
// Radios sweep in opposite directions for max coverage.
static void jam_bt_classic(void)
{
    hop_carrier(radio1, bt_classic_channels[sweep_ch1]);
    hop_carrier(radio2, bt_classic_channels[sweep_ch2]);

    if (sweep_dir1) { if (++sweep_ch1 >= BT_CLASSIC_CH_COUNT - 1) sweep_dir1 = false; }
    else            { if (sweep_ch1 == 0) sweep_dir1 = true; else sweep_ch1--; }

    if (sweep_dir2) { if (++sweep_ch2 >= BT_CLASSIC_CH_COUNT - 1) sweep_dir2 = false; }
    else            { if (sweep_ch2 == 0) sweep_dir2 = true; else sweep_ch2--; }
}

// BLE: all 40 data + advertising channels (even nRF24 channels 2-80)
static const uint8_t ble_all_channels[] = {
     2,  4,  6,  8, 10, 12, 14, 16, 18, 20,
    22, 24, 26, 28, 30, 32, 34, 36, 38, 40,
    42, 44, 46, 48, 50, 52, 54, 56, 58, 60,
    62, 64, 66, 68, 70, 72, 74, 76, 78, 80,
};
#define BLE_ALL_CH_COUNT (sizeof(ble_all_channels) / sizeof(ble_all_channels[0]))

// MODE 2: BLE ALL — CW cycle through all 40 BLE channels, radios offset by 20
static void jam_ble_all(void)
{
    hop_carrier(radio1, ble_all_channels[ble_idx1]);
    hop_carrier(radio2, ble_all_channels[ble_idx2]);
    ble_idx1 = (ble_idx1 + 1) % BLE_ALL_CH_COUNT;
    ble_idx2 = (ble_idx2 + 1) % BLE_ALL_CH_COUNT;
}

// MODE 4: BLE ADV — rapid-cycle both radios across the 3 BLE adv channels.
// Each radio hits a different channel per iteration, cycling fast.
static void jam_ble_adv(void)
{
    hop_carrier(radio1, ble_adv_channels[ble_adv_idx]);
    ble_adv_idx = (ble_adv_idx + 1) % 3;
    hop_carrier(radio2, ble_adv_channels[ble_adv_idx]);
    ble_adv_idx = (ble_adv_idx + 1) % 3;
}

// MODE 4: CONSTANT CARRIER — CW on ch 45 (baseline / single-channel test)
static void jam_constant_carrier(void)
{
    hop_carrier(radio1, 45);
    hop_carrier(radio2, 45);
}

static void print_mode(void)
{
    const char* modeStr = "UNKNOWN";
    switch (currentMode) {
        case MODE_BARRAGE:          modeStr = "BARRAGE (CW random hop, 130us PLL dwell)"; break;
        case MODE_BLE_ADV_BARRAGE:  modeStr = "ADV+BARRAGE (R1=adv ctrl, R2=random data — best for audio)"; break;
        case MODE_BT_CLASSIC:       modeStr = "BT CLASSIC (CW sweep, 130us dwell)"; break;
        case MODE_BLE_ALL:          modeStr = "BLE ALL (40 ch data+adv)"; break;
        case MODE_BLE_ADV:          modeStr = "BLE ADV (ch 2,26,80 sustained dwell)"; break;
        case MODE_CONSTANT_CARRIER: modeStr = "CONSTANT CARRIER (ch 45)"; break;
        default: break;
    }
    LOG_MODE("Current: %s", modeStr);
}

static void switch_mode(void)
{
    int prev = (int)currentMode;
    currentMode = (JammerMode)((currentMode + 1) % MODE_COUNT);
    s_mode_changed = true;
    LOG_MODE("Switch %d -> %d", prev, (int)currentMode);
    print_mode();
}
